# Rule: LSASS Memory Dump Attempt
index=* sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1
((CommandLine="*lsass*" AND CommandLine="*.dmp*") OR Image="*\\procdump.exe" OR Image="*\\procdump64.exe" OR (CommandLine="*comsvcs.dll*" AND CommandLine="*MiniDump*"))
| table _time host User Image ParentImage CommandLine
