# Rule: WMI Process Execution via WMIC
index=* sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1
Image="*\\wmic.exe" CommandLine="*process*" CommandLine="*call*" CommandLine="*create*"
| table _time host User Image ParentImage CommandLine
